# 5310 Group 8 ETL Process

#### Zimiao Gao, Shiqi Xie, Fawei Dai, Zeying Liu

### Extract

 #### Import Dataset

In [1]:
import pandas as pd
import numpy as np
import openpyxl

In [2]:
# Load the xlsx file in a dataframe
df = pd.read_excel('/Users/xieshiqi/Desktop/22Summer/5310/Group Project/Checkpoint 4/AlibabaDataset.xlsx')

In [3]:
df.head()

,order_id,order_has_products,product_id,product_option_id,product_category_id,user_id,vendor_id,category_name,product_name,descriptions,...,user_phone,user_age,product_option_inventory,order_paid_creditcard,creditcard_type,shopping_cart_id,shopping_cart_status,shoppingcart_has_product,shoppingcart_has_option,shoppingcart_has_option_quantity
0,1000,3600,3600,3602,4600,100,5000,Headphones,AirPods,AirPods deliver an incredible wireless headpho...,...,2240117165,79,325,6126788598555360,UnionPay,3018,1,1200.0,1204.0,2.0
1,1001,3400,3400,3401,4200,101,5000,Tablets,Ipad Pro (2021),The ultimate iPad experience. Now with breakth...,...,8449169189,29,304,4970405492149990,American Express,3048,1,1200.0,1203.0,1.0
2,1002,2900,2900,2901,4100,102,5000,Mobile phones,Iphone 13,"Features a ceramic shield front, Super Retina ...",...,6202549453,61,343,3625963619852530,Visa,3050,1,1200.0,1206.0,1.0
3,1003,3400,3400,3401,4200,103,5000,Tablets,Ipad Pro (2021),The ultimate iPad experience. Now with breakth...,...,1813281567,53,304,9576672166140650,UnionPay,3083,1,1200.0,1203.0,1.0
4,1003,2600,2600,2601,4600,103,5600,Headphones,COWIN E7 PRO,Active Noise Cancelling Headphone Bluetooth He...,...,1813281567,53,325,9576672166140650,UnionPay,3083,1,1200.0,1203.0,1.0

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19999 entries, 0 to 19998
Data columns (total 46 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   order_id                          19999 non-null  int64
 1   order_has_products                19999 non-null  int64
 2   product_id                        19999 non-null  int64
 3   product_option_id                 19999 non-null  int64
 4   product_category_id               19999 non-null  int64
 5   user_id                           19999 non-null  int64
 6   vendor_id                         19999 non-null  int64
 7   category_name                     19999 non-null  object
 8   product_name                      19999 non-null  object
 9   descriptions                      19999 non-null  object
 10  option_name                       19999 non-null  object
 11  vendor_name                       19999 non-null  object
 12  vendor_phone                      19999 non-null  int64
 13  vendor_email                      19999 non-null  object
 14  order_option_quantity             19999 non-null  int64
 15  option_original_price             19999 non-null  int64
 16  on_sale                           19999 non-null  int64
 17  selling_price                     19999 non-null  float64
 18  specs                             19999 non-null  object
 19  order_total_item                  19999 non-null  int64
 20  shipping_fee                      19999 non-null  int64
 21  tax                               19999 non-null  float64
 22  product_cost                      19999 non-null  float64
 23  total_cost                        19999 non-null  float64
 24  order_date                        19999 non-null  datetime64[ns]
 25  delivery_date                     19999 non-null  datetime64[ns]
 26  ship_name                         19999 non-null  object
 27  ship_address                      19999 non-null  object
 28  tracking_number                   19999 non-null  object
 29  delivery_status                   19999 non-null  int64
 30  username                          19999 non-null  object
 31  password                          19999 non-null  object
 32  first_name                        19999 non-null  object
 33  last_name                         19999 non-null  object
 34  address                           19999 non-null  object
 35  user_email                        19999 non-null  object
 36  user_phone                        19999 non-null  int64
 37  user_age                          19999 non-null  int64
 38  product_option_inventory          19999 non-null  int64
 39  order_paid_creditcard             19999 non-null  int64
 40  creditcard_type                   19999 non-null  object
 41  shopping_cart_id                  19999 non-null  int64
 42  shopping_cart_status              19999 non-null  int64
 43  shoppingcart_has_product          16024 non-null  float64
 44  shoppingcart_has_option           16024 non-null  float64
 45  shoppingcart_has_option_quantity  16024 non-null  float64
dtypes: datetime64[ns](2), float64(7), int64(20), object(17)
memory usage: 7.0+ MB

With the database and all tables created (3NF), it is now time to extract, transform, and load the dataset into the database.

First, we import the necessary packages for database connection and data analysis for later use. Then we use pd.read_excel to extract the alibaba dataset from excel files to python dataframe. 

However, the data read could not be loaded directly to the database for various reasons. For example, column names are inconsistent in excel and database tables; some ids are not existed in excel but needed in database tables as primary key; there are duplicates in excel files to be dropped since no repeating records is a requirement in 1NF; excel columns that are foreign keys needs to be referenced and merged to match database design.

Therefore, there are several data manipulation steps to convert data into the desired form for database design.

### Create Tables of 3NF

#### Connect to PostgreSQL

In [5]:
from sqlalchemy import create_engine
import psycopg2

conn_url = 'postgresql://postgres:sstt@localhost/alibaba' # Pass the connection string to a variable, conn_url
engine = create_engine(conn_url) # Create an engine that connects to PostgreSQL server
conn = engine.connect() # Establish a connection

#### Create 16 tables in a statement and execute

In [6]:
stmt="""

DROP TABLE IF EXISTS users CASCADE;
CREATE TABLE users(
user_id INT PRIMARY KEY, 
username VARCHAR(50) NOT NULL,
password VARCHAR(50) NOT NULL,
first_name VARCHAR(100) NOT NULL, 
last_name VARCHAR(100) NOT NULL, 
address VARCHAR(500) NOT NULL,
user_email VARCHAR(150) NOT NULL UNIQUE, 
user_phone NUMERIC(10) NOT NULL, 
user_age NUMERIC(2) NOT NULL 
);


DROP TABLE IF EXISTS orders CASCADE;
CREATE TABLE orders (
order_id INT PRIMARY KEY,
total_item INT NOT NULL,
shipping_fee NUMERIC(8,2) NOT NULL,
tax NUMERIC(8,2) NOT NULL,
product_cost NUMERIC(8,2) NOT NULL,
total_cost NUMERIC(8,2) NOT NULL,
order_date DATE NOT NULL,
delivery_date DATE NOT NULL CHECK (delivery_date > order_date),
ship_name VARCHAR (120) NOT NULL,
ship_address VARCHAR (500) NOT NULL,   
tracking_number CHAR(7) NOT NULL, 
delivery_status INT NOT NULL
);

DROP TABLE IF EXISTS categories CASCADE;
CREATE TABLE categories (
category_id INT PRIMARY KEY,
category_name VARCHAR(120) NOT NULL
);

DROP TABLE IF EXISTS products CASCADE;
CREATE TABLE products(
product_id INT PRIMARY KEY,
product_name VARCHAR(120) NOT NULL,
descriptions VARCHAR(800) NOT NULL,
category_id INT,
FOREIGN KEY (category_id) REFERENCES categories (category_id)
);

DROP TABLE IF EXISTS options CASCADE;
CREATE TABLE options(
option_id INT PRIMARY KEY,
option_name VARCHAR(120) NOT NULL
);

DROP TABLE IF EXISTS vendors CASCADE;
CREATE TABLE vendors(
vendor_id INT PRIMARY KEY,
vendor_name VARCHAR(120) NOT NULL,
vendor_phone NUMERIC(10) NOT NULL,
vendor_email VARCHAR(255) NOT NULL
);

DROP TABLE IF EXISTS creditcards CASCADE;
CREATE TABLE creditcards (
creditcard_number NUMERIC(16) PRIMARY KEY,
creditcard_type VARCHAR(50) NOT NULL
);

DROP TABLE IF EXISTS shoppingcarts CASCADE;
CREATE TABLE shoppingcarts(
shopping_cart_id INT PRIMARY KEY, 
shopping_cart_status INT NOT NULL 
);


---------------------------------------------------------------------------

DROP TABLE IF EXISTS product_sold_vendor CASCADE;
CREATE TABLE product_sold_vendor( 
vendor_id INT,
product_id INT,
FOREIGN KEY (vendor_id) REFERENCES vendors (vendor_id),
FOREIGN KEY (product_id) REFERENCES products (product_id),
PRIMARY KEY (vendor_id, product_id)
);

DROP TABLE IF EXISTS product_has_options CASCADE;
CREATE TABLE product_has_options(
product_id INT,
option_id INT,
inventory NUMERIC(10) NOT NULL,
option_original_price NUMERIC(10) NOT NULL,
on_sale INT NOT NULL,
selling_price NUMERIC(8,2) NOT NULL,
specs VARCHAR(800) NOT NULL,
FOREIGN KEY (product_id) REFERENCES products (product_id),
FOREIGN KEY (option_id) REFERENCES options (option_id),
PRIMARY KEY (product_id, option_id)
);

DROP TABLE IF EXISTS order_placed_user CASCADE;
CREATE TABLE order_placed_user( 
order_id INT,
user_id INT,
FOREIGN KEY (order_id) REFERENCES orders (order_id),
FOREIGN KEY (user_id) REFERENCES users (user_id),
PRIMARY KEY (order_id, user_id)
);

DROP TABLE IF EXISTS order_paid_creditcard CASCADE;
CREATE TABLE order_paid_creditcard(
order_id INT,
creditcard_number NUMERIC(19),
FOREIGN KEY (order_id) REFERENCES orders (order_id),
FOREIGN KEY (creditcard_number) REFERENCES creditcards (creditcard_number),
PRIMARY KEY (order_id, creditcard_number)
);

DROP TABLE IF EXISTS user_has_creditcard CASCADE;
CREATE TABLE user_has_creditcard(
user_id INT,
creditcard_number NUMERIC(16),
FOREIGN KEY (user_id) REFERENCES users (user_id),
FOREIGN KEY (creditcard_number) REFERENCES creditcards (creditcard_number),
PRIMARY KEY (user_id, creditcard_number)
);

DROP TABLE IF EXISTS cart_has_product CASCADE;
CREATE TABLE cart_has_product(
shopping_cart_id INT,
product_id INT,
option_id INT,
cart_option_quantity NUMERIC(100),
FOREIGN KEY (shopping_cart_id) REFERENCES shoppingcarts (shopping_cart_id),
FOREIGN KEY (product_id) REFERENCES products (product_id),
FOREIGN KEY (option_id) REFERENCES options (option_id),
PRIMARY KEY (shopping_cart_id, product_id, option_id)
);

DROP TABLE IF EXISTS user_shopping_cart CASCADE;
CREATE TABLE user_shopping_cart( 
user_id INT,
shopping_cart_id INT,
FOREIGN KEY (user_id) REFERENCES users (user_id),
FOREIGN KEY (shopping_cart_id) REFERENCES shoppingcarts (shopping_cart_id),
PRIMARY KEY (user_id, shopping_cart_id)
);

DROP TABLE IF EXISTS order_has_product CASCADE;
CREATE TABLE order_has_product(
order_id INT,
product_id INT,
option_id INT,
order_option_quantity INT NOT NULL, 
FOREIGN KEY (order_id) REFERENCES orders (order_id),
FOREIGN KEY (product_id) REFERENCES products (product_id),
FOREIGN KEY (option_id) REFERENCES options (option_id),
PRIMARY KEY (order_id, product_id, option_id)
);
"""

conn.execute(stmt) # Execute the statement to create tables

### Transfer and Load

#### Clean and Merge Data and Load to PostgreSQL

In [7]:
vendors_df=df[['vendor_id','vendor_name','vendor_phone','vendor_email']] 
vendors_df=vendors_df.dropna().drop_duplicates() # Eliminate duplicate rows and push to the database
vendors_df.to_sql(name='vendors',con=conn,if_exists='append',index=False) 
vendors_df

    vendor_id vendor_name  vendor_phone         vendor_email
0        5000      Apple     2569561656      apple@gmail.com
4        5600       Sony     4846531876       sony@gmail.com
5        5700     Samsung    8559661109    samsung@gmail.com
10       5300       Asus     9568484613       asus@gmail.com
18       5200     Lenovo     3215689466     lenovo@gmail.com
19       5400       Dell     8465473132       dell@gmail.com
21       5100  Microsoft     6165486561  microsoft@gmail.com
56       5500  Monoprice     3189831684  monoprice@gmail.com

The sequence principle of importing table data is first to import the table without foreign key constraints and then import the table with foreign key constraints. We select the data in the data frame that matches our created database table. Then, we dropped the null values and duplicated rows and pushed them to the database.

In [8]:
categories_df=df[['product_category_id','category_name']]
categories_df.columns=['category_id','category_name'] 
categories_df=categories_df.dropna().drop_duplicates()
categories_df.to_sql(name='categories',con=conn,if_exists='append',index=False)
categories_df

    category_id  category_name
0          4600     Headphones
1          4200        Tablets
2          4100  Mobile phones
9          4000        Laptops
10         4300        Servers
19         4400             PC
56         4500         Cables

In the categories table, we found that the categories
_id columnâ€™s name in the excel dataset differs from that in the database table. We renamed the product_category_id to category_id to keep the column name the same to ensure it can be successfully loaded to the database.

In [9]:
options_df=df[['product_option_id','option_name']]
options_df.columns=['option_id','option_name']
options_df=options_df.dropna().drop_duplicates()
options_df.to_sql(name='options',con=conn,if_exists='append',index=False)
options_df

     option_id                                        option_name
0         3602                             AirPods 3rd generation
1         3401                             Ipad Pro 11-inch 128GB
2         2901                                    Iphone 13 128GB
4         2601                                COWIN E7 PRO - Pink
5         3001                        Samsung Galaxy S9 Plus 64GB
..         ...                                                ...
148       3201    Samsung Galaxy S20 Ultra 256GB storage 12GB RAM
182       1802                                  Ipad Mini 10-inch
189       2802                                    Iphone 12 128GB
192       1601                                      Iphone 8 64GB
305       1902  ESC8000 G3 - 8 G Intel Xeon E5-1620 v3 (3.5G,1...

[61 rows x 2 columns]

In [10]:
users_df=df[['user_id','username','password','first_name','last_name','address','user_email','user_phone','user_age']]
users_df=users_df.dropna().drop_duplicates()
users_df.to_sql(name='users',con=conn,if_exists='append',index=False)
users_df

,user_id,username,password,first_name,last_name,address,user_email,user_phone,user_age
0,100,jamessm578,gtaj1253,Anna,Addison,"1325 Candy Rd, San Francisco, CA 96123",anna.addison@yahoo.com,2240117165,79
1,101,michaelsm1299,nggw305,Julia,Jones,"1931 Brown St, Gainesville, FL 85321",julia.jones@msn.com,8449169189,29
2,102,robertsm181,kbir2741,Rachel,Rose,"1622 Seaside St, Seattle, WA 32569",rachel.rose@qq.com,6202549453,61
3,103,davidsm310,pvto1893,Sophie,Sutton,"1756 East Dr, Houston, TX 28562",sophie.sutton@msn.com,1813281567,53
7,104,jamesjo1594,vmzf3232,Wendy,West,"1465 River Dr, Boston, MA 43625",wendy.west@msn.com,5185149679,62
...,...,...,...,...,...,...,...,...,...
14275,10095,BrianHen4135,ByHiEgS804,Brian,Hensley,"476 Hawthorne Ave.Northbrook, IL 60062",Brian.Hensle@pobox.com,5116324566,62
14277,10096,KathyZam17396,AdLsWyQ554,Kathy,Zamora,"96 Glen Ridge StreetRoslindale, MA 02131",Kathy.Zamora@hush.com,9274388536,19
14278,10097,MatthewRod97108,ChYmTgO667,Matthew,Rodriguez,"9407 Sutor StreetTualatin, OR 97062",Matthew.Rodrig@hotmail.com,6589409098,45
14279,10098,BrittanySul84382,WjYsYiW524,Brittany,Sullivan,"344 Nichols St.Shirley, NY 11967",Brittany.Sulliv@qq.com,3075116521,26
14281,10099,CindyMar78694,PgTeOlV412,Cindy,Martin,"7 Theatre CourtEmporia, KS 66801",Cindy.Martin@msn.com,3185225446,32

In [11]:
creditcards_df=df[['order_paid_creditcard','creditcard_type']]
creditcards_df.columns=['creditcard_number','creditcard_type']
creditcards_df=creditcards_df.dropna().drop_duplicates()
creditcards_df.to_sql(name='creditcards',con=conn,if_exists='append',index=False)
creditcards_df

       creditcard_number            creditcard_type
0       6126788598555360                   UnionPay
1       4970405492149990           American Express
2       3625963619852530                       Visa
3       9576672166140650                   UnionPay
7       9901070946340140                Master Card
...                  ...                        ...
18564   7523001299400700                       Visa
18566   9001119180383430           American Express
18567   4313000569783780  Diners Club International
18569   1583460579650210                       Visa
18570   1960481576334740           American Express

[13000 rows x 2 columns]

In [12]:
user_has_creditcard_df=df[['user_id','order_paid_creditcard']]
user_has_creditcard_df.columns=['user_id','creditcard_number']
user_has_creditcard_df=user_has_creditcard_df.dropna().drop_duplicates()
user_has_creditcard_df.to_sql(name='user_has_creditcard',con=conn,if_exists='append',index=False)
user_has_creditcard_df

       user_id  creditcard_number
0          100   6126788598555360
1          101   4970405492149990
2          102   3625963619852530
3          103   9576672166140650
7          104   9901070946340140
...        ...                ...
19992     6394   9869577369539750
19994     8667   9915345943247160
19995     5785   2859723676561060
19996      807   2895228872532840
19997     4057   4917040388318870

[14000 rows x 2 columns]

In [13]:
orders_df=df[['order_id','order_total_item','shipping_fee','tax','product_cost','total_cost','order_date','delivery_date','ship_name','ship_address','tracking_number','delivery_status']]
orders_df=orders_df.rename(columns={'order_total_item':'total_item'}) 
orders_df=orders_df.dropna().drop_duplicates()
orders_df.to_sql(name='orders',con=conn,if_exists='append',index=False)
orders_df

,order_id,total_item,shipping_fee,tax,product_cost,total_cost,order_date,delivery_date,ship_name,ship_address,tracking_number,delivery_status
0,1000,4,5,44.75000,716.0,765.75000,2022-04-14,2022-04-17,Anna Addison,"1325 Candy Rd, San Francisco, CA 96123",ZW60001,0
1,1001,1,5,49.93750,799.0,853.93750,2021-11-28,2021-12-11,Julia Jones,"1622 Seaside St, Seattle, WA 32569",CD62001,0
2,1002,2,5,103.62500,1658.0,1766.62500,2021-08-07,2021-08-19,Rachel Rose,"1465 River Dr, Boston, MA 43625",IK64001,0
3,1003,7,7,345.46250,5527.4,5879.86250,2021-07-26,2021-08-07,Sophie Sutton,"1896 West Dr, Portland, OR 65842",OP65001,0
7,1004,1,5,63.50625,1016.1,1084.60625,2021-11-02,2021-11-06,Wendy West,"1252 Vine St, Chicago, IL 73215",XH66001,0
...,...,...,...,...,...,...,...,...,...,...,...,...
19992,14996,4,5,239.37500,3830.0,4074.37500,2021-12-12,2021-12-23,Danielle Campbell,"8743 Purple Finch Dr.Prior Lake, MN 55372",FG16804,0
19994,14997,2,5,56.13750,898.2,959.33750,2022-04-11,2022-04-17,Laura Armstrong,"7 Lake DriveNiagara Falls, NY 14304",DC39089,0
19995,14998,1,5,58.06250,929.0,992.06250,2022-01-13,2022-01-23,Cynthia Gamble,"8670 Shub Farm St.Kaukauna, WI 54130",GK12034,0
19996,14999,6,7,224.62500,3594.0,3825.62500,2021-11-18,2021-11-25,Susan Dempsey,"9995 Wayne St.New Britain, CT 06051",MI21935,0
19997,15000,4,5,176.01875,2816.3,2997.31875,2021-10-30,2021-11-06,Kathleen Wright,"84 Joy Ridge St.Noblesville, IN 46060",BP98301,0

In [14]:
order_paid_creditcard_df=df[['order_id','order_paid_creditcard']]
order_paid_creditcard_df.columns=['order_id','creditcard_number']
order_paid_creditcard_df=order_paid_creditcard_df.dropna().drop_duplicates()
order_paid_creditcard_df.to_sql(name='order_paid_creditcard',con=conn,if_exists='append',index=False)
order_paid_creditcard_df

       order_id  creditcard_number
0          1000   6126788598555360
1          1001   4970405492149990
2          1002   3625963619852530
3          1003   9576672166140650
7          1004   9901070946340140
...         ...                ...
19992     14996   9869577369539750
19994     14997   9915345943247160
19995     14998   2859723676561060
19996     14999   2895228872532840
19997     15000   4917040388318870

[14001 rows x 2 columns]

In [15]:
order_placed_user_df=df[['order_id','user_id']]
order_placed_user_df=order_placed_user_df.dropna().drop_duplicates()
order_placed_user_df.to_sql(name='order_placed_user',con=conn,if_exists='append',index=False)
order_placed_user_df

       order_id  user_id
0          1000      100
1          1001      101
2          1002      102
3          1003      103
7          1004      104
...         ...      ...
19992     14996     6394
19994     14997     8667
19995     14998     5785
19996     14999      807
19997     15000     4057

[14001 rows x 2 columns]

In [16]:
products_df=df[['product_id','product_name','descriptions','product_category_id']]
products_df.columns=['product_id','product_name','descriptions','category_id']
products_df=products_df.dropna().drop_duplicates()
products_df.to_sql(name='products',con=conn,if_exists='append',index=False)
products_df

,product_id,product_name,descriptions,category_id
0,3600,AirPods,AirPods deliver an incredible wireless headpho...,4600
1,3400,Ipad Pro (2021),The ultimate iPad experience. Now with breakth...,4200
2,2900,Iphone 13,"Features a ceramic shield front, Super Retina ...",4100
4,2600,COWIN E7 PRO,Active Noise Cancelling Headphone Bluetooth He...,4600
5,3000,Samsung Galaxy S9 Plus,SAMSUNG Galaxy S9+ Factory Unlocked Android Sm...,4100
9,1200,Macbook Pro,The new M2 chip makes the 13â€‘inch MacBook Pro ...,4000
10,2000,ESC8000 G4,G4 High performance ASUS 2U server with hybrid...,4300
11,2500,Avantree HT3189 Wireless Headphones,Avantree HT3189 Wireless Headphones for TV Wat...,4600
13,2800,Iphone 12,A superpowerful chip. 5G speed. An advanced du...,4100
14,3500,Ipad Air (2022),Supercharged by the Apple M1 chip. 12MP Ultra ...,4200
18,1700,Ipad Air,4th gen The iPad Air is unbelievably thin and ...,4200
19,2200,XPS 15 - 5070,Ultra-thin and distinctly refined the stylish ...,4400
20,2100,XPS 13 - 5080,Thinner and more powerful than ever the Dell X...,4400
21,1500,Iphone 7,Great connectivity of this device includes Blu...,4100
28,1600,Iphone 8,iPhone 8 introduces a glass design. The glass ...,4100
30,2700,Iphone 11,iPhone 11 features a precision-machined 7000 s...,4100
36,3800,Lenovo ThinkPad X1 Carbon Gen 9,Designed on IntelÂ® Evoâ„¢ vProÂ® platform. Ultrat...,4000
38,1400,Iphone X,The iPhone X display is so immersive the devic...,4100
44,1800,Ipad Mini 3th gen,3th gen Everything you love about iPad ?the be...,4200
46,3100,Samsung Galaxy S10 Plus,The Sansung Galaxy S10 Plus LCD replacement sc...,4100
56,2400,Monoprice Ultra Slim Series High Speed HDMI Ca...,Monoprice Commercial Cable supports the follow...,4500
60,3700,AirPods Pro,Active Noise Cancellation for immersive sound....,4600
67,1900,ESC8000 G3,G3 High-density GPU server with hybrid computi...,4300
72,4000,Lenovo Yoga 7i 2 in 1 Laptop,Designed on IntelÂ® Evoâ„¢ platform that provides...,4000
78,3900,Lenovo ThinkPad T15 Gen 2,"15"" business pc with powerful IntelÂ® Coreâ„¢ pro...",4000
79,2300,Monoprice Ultra Slim Series High Speed HDMI Cable,The Monoprice Ultra Slim Active High Speed HDM...,4500
86,3300,Samsung Galaxy S21+,Samsung Galaxy S21 Plus 5G,4100
113,1300,Macbook Air,MacBook Air is strikingly thin and brings exce...,4000
148,3200,Samsung Galaxy S20 Ultra,Samsung Galaxy S20 Ultra 5G* First-of-its-kind...,4100

In [17]:
product_sold_vendor_df=pd.merge(df,products_df,on='product_id')[['product_id','vendor_id']]
product_sold_vendor_df=product_sold_vendor_df.dropna().drop_duplicates()
product_sold_vendor_df.to_sql(name='product_sold_vendor',con=conn,if_exists='append',index=False)
product_sold_vendor_df

       product_id  vendor_id
0            3600       5000
1207         3400       5000
3205         2900       5000
5625         2600       5600
6056         3000       5700
6475         1200       5000
8457         2000       5300
8850         2500       5600
9249         2800       5000
10096        3500       5000
11259        1700       5200
12037        2200       5400
12416        2100       5400
12841        1500       5100
13237        1600       5100
13635        2700       5000
14048        3800       5200
14448        1400       5100
14853        1800       5200
15623        3100       5700
16062        2400       5500
16468        3700       5000
17223        1900       5300
17622        4000       5200
18031        3900       5200
18422        2300       5500
18804        3300       5700
19199        1300       5000
19597        3200       5700

If the table exists with foreign keys, merge the current dataset referred to by this key to get the intersection. For instance, only the rows that contain product_id values that are common between df and products_df remain in the merged data. Then, we dropped the unnecessary columns and duplicates after merging and loaded them into the database.

In [18]:
product_has_options_df=pd.merge(df,products_df,on='product_id')[['product_id','product_option_id','product_option_inventory','option_original_price','on_sale','selling_price','specs']]
product_has_options_df=product_has_options_df.dropna().drop_duplicates()
product_has_options_df=product_has_options_df.rename(columns={'product_option_id':'option_id','product_option_inventory':'inventory'})
product_has_options_df.to_sql(name='product_has_options',con=conn,if_exists='append',index=False)
product_has_options_df

,product_id,option_id,inventory,option_original_price,on_sale,selling_price,specs
0,3600,3602,325,129,0,129.0,AirPods (2nd generation)
1,3600,3601,342,129,0,129.0,AirPods (2nd generation)
1207,3400,3401,304,799,0,799.0,Ipad Pro 11-inch Storage capacity 128GB
1209,3400,3402,300,799,0,799.0,Ipad Pro 11-inch Storage capacity 128GB
1210,3400,3403,315,799,0,799.0,Ipad Pro 11-inch Storage capacity 128GB
...,...,...,...,...,...,...,...
18422,2300,2302,338,15,0,15.0,Monoprice Ultra Slim 24Hz High Speed HDMI Cabl...
18423,2300,2301,326,15,0,15.0,Monoprice Ultra Slim 24Hz High Speed HDMI Cabl...
18804,3300,3301,325,1049,1,944.1,Samsung Galaxy S21+ SM-G996BDS (256GB)
19199,1300,1301,343,999,0,999.0,Supercharged by the Apple M1 chip. 12MP Ultra ...
19597,3200,3201,317,1350,1,1215.0,"Samsung Galaxy S20 Ultra (256GB storage, 12GB ..."

In [19]:
order_has_product_df=pd.merge(df,products_df,on='product_id')[['order_id','product_id','product_option_id','order_option_quantity']]
order_has_product_df=order_has_product_df.dropna().drop_duplicates()
order_has_product_df=order_has_product_df.rename(columns={'product_option_id':'option_id'})
order_has_product_df.to_sql(name='order_has_product',con=conn,if_exists='append',index=False)
order_has_product_df

       order_id  product_id  option_id  order_option_quantity
0          1000        3600       3602                      4
1          1008        3600       3601                      1
2          1009        3600       3602                      2
3          1046        3600       3601                      2
4          1047        3600       3602                      2
...         ...         ...        ...                    ...
19994     14971        3200       3201                      4
19995     14972        3200       3201                      1
19996     14974        3200       3201                      1
19997     14976        3200       3201                      1
19998     14996        3200       3201                      2

[19844 rows x 4 columns]

In [20]:
shoppingcarts_df=df[['shopping_cart_id','shopping_cart_status']]
shoppingcarts_df=shoppingcarts_df.dropna().drop_duplicates()
shoppingcarts_df.to_sql(name='shoppingcarts',con=conn,if_exists='append',index=False)
shoppingcarts_df

       shopping_cart_id  shopping_cart_status
0                  3018                     1
1                  3048                     1
2                  3050                     1
3                  3083                     1
7                  3111                     1
...                 ...                   ...
14275             12673                     1
14277             12703                     1
14278             12760                     1
14279             12869                     1
14281             12968                     1

[10000 rows x 2 columns]

In [21]:
cart_has_product_df=pd.merge(df,products_df,on='product_id')[['shopping_cart_id','product_id','shoppingcart_has_option','shoppingcart_has_option_quantity']]
cart_has_product_df=cart_has_product_df.dropna().drop_duplicates()
cart_has_product_df=cart_has_product_df.rename(columns={'shoppingcart_has_option':'option_id','shoppingcart_has_option_quantity':'cart_option_quantity'})
cart_has_product_df.to_sql(name='cart_has_product',con=conn,if_exists='append',index=False)
cart_has_product_df

       shopping_cart_id  product_id  option_id  cart_option_quantity
0                  3018        3600     1204.0                   2.0
1                  3157        3600     1204.0                   1.0
2                  3158        3600     1206.0                   1.0
3                  3598        3600     1202.0                   5.0
5                  3859        3600     1204.0                   2.0
...                 ...         ...        ...                   ...
19994              7282        3200     2201.0                   2.0
19995             12367        3200     3404.0                   2.0
19996              9222        3200     2801.0                   1.0
19997              9179        3200     2801.0                   2.0
19998             12893        3200     3406.0                   2.0

[15318 rows x 4 columns]

In [22]:
user_shopping_cart_df=df[['user_id','shopping_cart_id']]
user_shopping_cart_df=user_shopping_cart_df.dropna().drop_duplicates()
user_shopping_cart_df.to_sql(name='user_shopping_cart',con=conn,if_exists='append',index=False)
user_shopping_cart_df

       user_id  shopping_cart_id
0          100              3018
1          101              3048
2          102              3050
3          103              3083
7          104              3111
...        ...               ...
14275    10095             12673
14277    10096             12703
14278    10097             12760
14279    10098             12869
14281    10099             12968

[10000 rows x 2 columns]

### Close the connection with the PostgreSQL

In [25]:
conn.close()

After transforming data format, we need to load the structured data into a PostgreSQL database. df.to_sql is used to fulfill this task. It is easy to see when we transform every tableâ€™s data, df.to_sql is the last but most important clause to load data into the corresponding database table.

Now, all the data are well organized in the database and ready for analysis and visualization.